src/cfe/МенеджерСинхронизаций/Catalogs/МС_ЗапросыКВнешнимИсточникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_ЗапросыКВнешнимИсточникам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресатПерсонализированнойРассылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКодЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияНовыхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияОбработанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопироватьФайлыВЛокальныйКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодифицироватьИмяФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцедураПодготовкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗапросаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧЗначенияПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧНастройкаСоответствий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьФайлыИзКаталогаИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Редактирование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/CommonForms/МС_ФормаЗагрузкиИзТабличногоДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнительныеПараметры = Новый Структура("ВызовИзФормы", Истина);
	ДополнительныеПараметры.Вставить("НомерСтрокиНастройки", Параметры.НомерСтрокиНастройки);
	ДополнительныеПараметры.Вставить("КодНастройки", Параметры.КодНастройки);
	
	ПодключаемыеСинхронизации = МС_СинхронизацияСервер.ПодключаемыеКомандыСинхронизации(Параметры);
	
	Если ПодключаемыеСинхронизации.Количество() = 0 Тогда
		Возврат;
	Иначе
		СтрокаСинхронизации = ПодключаемыеСинхронизации[0];
	КонецЕсли;
	
	Если Параметры.Свойство("МассивСсылок") Тогда
		
		// При вызове из формы объекта
		ДополнительныеПараметры.Вставить("МассивСсылок", Параметры.МассивСсылок);
		
	КонецЕсли;
	
	НастройкаСинхронизации = СтрокаСинхронизации.Ссылка;
	
	ВыборкаДетальныеЗаписи = МС_СинхронизацияСервер.ВыборкаНастроекСинхронизации(СтрокаСинхронизации.Ссылка, ДополнительныеПараметры);
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		НастройкаСоответствий = ОбщегоНазначения.ЗначениеИзСтрокиXML(ВыборкаДетальныеЗаписи.ТЧНастройкаСоответствий);
		
		СтруктураПараметров = МС_СинхронизацияСервер.СтруктураПараметровИзВыборкиНастроекСинхронизации(ВыборкаДетальныеЗаписи, ДополнительныеПараметры);
		
		СоответствиеКолонок = МС_СинхронизацияСервер.СоответствиеИзТаблицыСоответствий("НомерКолонки", НастройкаСоответствий);
		
		ПодготовитьТабличныйДокумент(ТабличныйДокумент, СоответствиеКолонок);
		
		ДобавитьТаблицуРезультатСопоставления(СоответствиеКолонок);
		
	Иначе	
		Сообщить("Не удалось найти настройку загрузки.");
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТаблицуРезультатСопоставления(СоответствиеКолонок = Неопределено, ТаблицаЗначенийДляФормы = Неопределено)
	
	Если Не ТаблицаЗначенийДляФормы = Неопределено Тогда
		// Передана подготовленная таблица значений
		
	ИначеЕсли СоответствиеКолонок.Количество() > 0 Тогда
		// Заполняем по соответствию колонок из настроек обмена
		
		ТаблицаЗначенийДляФормы = Новый ТаблицаЗначений;
		Для каждого ЭлементСоответствиеКолонок Из СоответствиеКолонок Цикл
			ТаблицаЗначенийДляФормы.Колонки.Добавить(ЭлементСоответствиеКолонок.Ключ);
		КонецЦикла; 
		
	Иначе 
		
		Сообщить("Не удалось создать таблицу заполнения, возможно в настройках не заданы соответствия колонок.");
		
	КонецЕсли;
	
	Если ТаблицаЗначенийДляФормы.Колонки.Количество() = 0 Тогда
		
		Сообщить("Не удалось создать таблицу заполнения, возможно в настройках не заданы соответствия колонок.");
		
	Иначе
		
		МассивТипаВыбора = Новый Массив;
		МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
		ОписаниеТипаВыбора = Новый ОписаниеТипов(МассивТипаВыбора);
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ТаблцаРезультатСопоставления", ОписаниеТипаВыбора, "", "Результат сопоставления"));
		
		Для Каждого КолонкаТаблицаЗначенийДляФормы Из ТаблицаЗначенийДляФормы.Колонки Цикл
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы(КолонкаТаблицаЗначенийДляФормы.Имя, КолонкаТаблицаЗначенийДляФормы.ТипЗначения,"ТаблцаРезультатСопоставления"));
			
		КонецЦикла;
		
		ИзменитьРеквизиты(МассивРеквизитов);      
		
		ЭлементТаблица = Элементы.Добавить("ТаблцаРезультатСопоставления", Тип("ТаблицаФормы"), Элементы.ГруппаДанныеДляЗагрузки);
		ЭлементТаблица.ПутьКДанным = "ТаблцаРезультатСопоставления";
		ЭлементТаблица.Отображение = ОтображениеТаблицы.Список;
		ЭлементТаблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Верх;
		ЭлементТаблица.ИзменятьСоставСтрок = Ложь;    
		
		Для Каждого Колонка Из ТаблицаЗначенийДляФормы.Колонки Цикл
			НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ЭлементТаблица);
			НовыйЭлемент.ПутьКДанным = "ТаблцаРезультатСопоставления" + "." + Колонка.Имя;
			Если Колонка.Имя = "Выб" Тогда
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			Иначе
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.КнопкаОчистки = Ложь;
				НовыйЭлемент.КнопкаВыбора = Ложь;
				НовыйЭлемент.РедактированиеТекста = Ложь;
				НовыйЭлемент.КнопкаОткрытия = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ЭтаФорма.ЗначениеВРеквизитФормы(ТаблицаЗначенийДляФормы, "ТаблцаРезультатСопоставления");
		
	КонецЕсли; 
	
КонецПроцедуры
 

&НаКлиентеНаСервереБезКонтекста
Процедура ПодготовитьТабличныйДокумент(ТабличныйДокумент, СоответствиеКолонок)

	// Очистка шапки
	Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ТабличныйДокумент.Область(1,НомерКолонки).Текст = "";
		ТабличныйДокумент.Область(, НомерКолонки,, НомерКолонки).ШиринаКолонки = 10;
	КонецЦикла; 
	
	Если СоответствиеКолонок.Количество() > 0 Тогда

		// Заполняем по соответствию колонок из настроек обмена
		Для каждого ЭлементСоответствиеКолонок Из СоответствиеКолонок Цикл
			ТабличныйДокумент.Область(1,ЭлементСоответствиеКолонок.Значение).Текст = ЭлементСоответствиеКолонок.Ключ;
			ТабличныйДокумент.Область(, ЭлементСоответствиеКолонок.Значение,, ЭлементСоответствиеКолонок.Значение).ШиринаКолонки = 30;
		КонецЦикла; 
		
	Иначе 
		
		Сообщить("Не удалось создать таблицу заполнения, возможно в настройках не заданы соответствия колонок.");
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеНаСервере()
	
	// ДополнительныеПараметры уже определены при создании формы
	
	// Чтобы данные брались не из файлов, а из табличного документа на форме
	ДополнительныеПараметры.Вставить("СпособЗапросаДанных", "ПроизвольныйРезультат");
	
	// Табличный документ с данными
	МассивТабличныхДокументов = Новый Массив;
	МассивТабличныхДокументов.Добавить(ТабличныйДокумент);
	ДополнительныеПараметры.Вставить("МассивТабличныхДокументов", МассивТабличныхДокументов);
	
	// Чтобы вернулся табличный документ вместо массива файлов
	ДополнительныеПараметры.Вставить("КодЗапроса", "РезультатЗапроса = СтруктураПараметров.МассивТабличныхДокументов");
	
	// Чтобы не выполнялась часть кода необходимая для загрузки.
	ДополнительныеПараметры.Вставить("ТолькоСопоставление", Истина);
	
	Справочники.МС_ЗапросыКВнешнимИсточникам.ВыполнитьЗагрузкуДокументов(НастройкаСинхронизации, , ДополнительныеПараметры);
	
	// Удаляем старую таблицу
	МассивУдаляемыхРеквизитов = Новый Массив;
	МассивУдаляемыхРеквизитов.Добавить("ТаблцаРезультатСопоставления");
	ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
	Элементы.Удалить(Элементы.ТаблцаРезультатСопоставления);
	
	ДобавитьТаблицуРезультатСопоставления(, ДополнительныеПараметры.СопоставленныеДанные);
	
	// Чтобы параметры нормально вернулись на клиент.
	ДополнительныеПараметры.СопоставленныеДанные = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьДанные(Команда)
	СопоставитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("ОбъектыЭксплуатации");
	
	МассивСтруктурДляВозврата = МС_СинхронизацияКлиентСервер.МассивСтруктурИзТаблицы(Этаформа.ТаблцаРезультатСопоставления, МассивКолонок);
	
	СтруктураИнтерактивногоЗаполнения = Новый Структура;
	СтруктураИнтерактивногоЗаполнения.Вставить("СпособЗапросаДанных", "ПроизвольныйРезультат");
	СтруктураИнтерактивногоЗаполнения.Вставить("КодЗапроса", "РезультатЗапроса = СтруктураПараметров.МассивСопоставленныхДанных");
	СтруктураИнтерактивногоЗаполнения.Вставить("НастройкаСинхронизации", НастройкаСинхронизации);
	СтруктураИнтерактивногоЗаполнения.Вставить("ЗаполнениеПоСопоставленнымДанным", Истина);
	
	МассивСопоставленныхДанных = Новый Массив;
	МассивСопоставленныхДанных.Добавить(МассивСтруктурДляВозврата);
	СтруктураИнтерактивногоЗаполнения.Вставить("МассивСопоставленныхДанных", МассивСопоставленныхДанных);
	
	Закрыть(СтруктураИнтерактивногоЗаполнения);
	
КонецПроцедуры
